const gamesSettings = {
  center: {
    name: "Поймай центр",
    question: "Точка находится по центру фигуры?",
    rules: {
      title: "Можешь определить, где находится центр фигуры?",
      task: "Внутри фигуры помещена точка. Твоя задача - определить находится ли точка центре фигуры",
      motivation: "Можешь ли ты угадать все фигуры, чтобы выиграть? Чего же ты ждешь?"
    }
  },
  compare_colors: {
    name: "Сравни цвета",
    question: "Какой из квадратов отличается по цвету?",
    rules: {
      title: "Можешь определить, какая из фигур отличается по цвету от других?",
      task: "Перед тобой 4 прямоугольника. Твоя задача - определить, какой из них отличается от других по цвету",
      motivation: "Можешь ли ты различить цвета во всех фигурах, чтобы выиграть? Чего же ты ждешь?"
    }
  },
  colors: {
    name: "Тот же самый",
    question: "Цвета в квадратиках одинаковы с фоном?",
    rules: {
      title: "Можешь определить, являются ли маленькие квадратики по цвету такими же, как и внешние квадратики?",
      task: "Перед тобой 4 квадратика. Твоя задача - определить, имеют ли внутренние квадратики такой же цвет, как и внешние",
      motivation: "Можешь ли ты различить цвета во всех фигурах, чтобы выиграть? Чего же ты ждешь?"
    }
  }
}

export { gamesSettings };